Revit 2026 API

# SpaceAreaperPerson Property

---

Get or set the Area per Person of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AreaperPerson { get; set; }
```
```vb
Public Property AreaperPerson As Double
	Get
	Set
```
```cpp
public:
property double AreaperPerson {
	double get ();
	void set (double value);
}
```
```fsharp
member AreaperPerson : float with get, set
```

#### Property Value

Double

This property is used to get or set Area per Person of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace